{
    "title":  "RLGF: Reinforcement Learning with Geometric Feedback for Autonomous Driving Video Generation",
    "short_title":  "RLGF",
    "authors":  [
                    "Tianyi Yan",
                    "Wencheng Han",
                    "xia zhou",
                    "Xueyang Zhang",
                    "Kun Zhan",
                    "Cheng-zhong Xu",
                    "Jianbing Shen"
                ],
    "first_author":  "Yan",
    "venue":  "NeurIPS 2025",
    "presentation_type":  "poster",
    "openreview_url":  "https://openreview.net/forum?id=EATkC9iHE3",
    "openreview_id":  "EATkC9iHE3",
    "pdf_url":  "/pdf/8b4d444543586225a5063e12afc6cf6ddd469eb5.pdf",
    "abstract":  "Synthetic data is crucial for advancing autonomous driving (AD) systems, yet current state-of-the-art video generation models, despite their visual realism, suffer from subtle geometric distortions that limit their utility for downstream perception tasks. \nWe identify and quantify this critical issue, demonstrating a significant performance gap in 3D object detection when using synthetic versus real data.\nTo address this, we introduce Reinforcement Learning with Geometric Feedback (RLGF), RLGF uniquely refines video diffusion models by incorporating rewards from specialized latent-space AD perception models. \nIts core components include an efficient Latent-Space Windowing Optimization technique for targeted feedback during diffusion, and a Hierarchical Geometric Reward (HGR) system providing multi-level rewards for point-line-plane alignment, and scene occupancy coherence. \nTo quantify these distortions, we propose GeoScores. Applied to models like DiVE on nuScenes, RLGF substantially reduces geometric errors (e.g., VP error by 21\\%, Depth error by 57\\%) and dramatically improves 3D object detection mAP by 12.7\\%, narrowing the gap to real-data performance. RLGF offers a plug-and-play solution for generating geometrically sound and reliable synthetic videos for AD development.",
    "keywords":  [
                     "video generation",
                     "diffusion model",
                     "autonomous driving"
                 ],
    "local_pdf":  "RLGF_NeurIPS2025.pdf"
}
