{
    "title":  "IOSTOM: Offline Imitation Learning from Observations via State Transition Occupancy Matching",
    "short_title":  "IOSTOM",
    "authors":  [
                    "Quang Anh Pham",
                    "Janaka Chathuranga Brahmanage",
                    "Tien Anh Mai",
                    "Akshat Kumar"
                ],
    "first_author":  "Pham",
    "venue":  "NeurIPS 2025",
    "presentation_type":  "poster",
    "openreview_url":  "https://openreview.net/forum?id=OEp1J4V2fN",
    "openreview_id":  "OEp1J4V2fN",
    "pdf_url":  "/pdf/e73319769efe9232fee21c9c1f024e326b372b52.pdf",
    "abstract":  "Offline Learning from Observations (LfO) focuses on enabling agents to imitate expert behavior using datasets that contain only expert state trajectories and separate transition data with suboptimal actions. This setting is both practical and critical in real-world scenarios where direct environment interaction or access to expert action labels is costly, risky, or infeasible. Most existing LfO methods attempt to solve this problem through state  or state-action occupancy matching. They typically rely on pretraining a discriminator to differentiate between expert and non-expert states, which could introduce errors and instability—especially when the discriminator is poorly trained. While recent discriminator-free methods have emerged, they generally require substantially more data, limiting their practicality in low-data regimes. In this paper, we propose IOSTOM ($\\textit{Imitation from Observation via State Transition Occupancy Matching}$), a novel offline LfO algorithm designed to overcome these limitations. Our approach formulates a learning objective based on the joint state visitation distribution. A key distinction of IOSTOM is that it first excludes actions entirely from the training objective. Instead, we learn an $\\textit{implicit policy}$ that models transition probabilities between states, resulting in a more compact and stable optimization problem. To recover the expert policy, we introduce an efficient action inference mechanism that $\\textit{avoids training an inverse dynamics model}$. Extensive empirical evaluations across diverse offline LfO benchmarks show that IOSTOM substantially outperforms state-of-the-art methods, demonstrating both improved performance and data efficiency.",
    "keywords":  [
                     "Learning from Observations",
                     "Imitation Learning"
                 ],
    "local_pdf":  "IOSTOM_NeurIPS2025.pdf"
}
