{
    "title":  "Towards foundational LiDAR world models with efficient latent flow matching",
    "short_title":  "Towards foundational LiDAR wor",
    "authors":  [
                    "Tianran Liu",
                    "Shengwen Zhao",
                    "Nicholas Rhinehart"
                ],
    "first_author":  "Liu",
    "venue":  "NeurIPS 2025",
    "presentation_type":  "poster",
    "openreview_url":  "https://openreview.net/forum?id=OyX9cC9WaV",
    "openreview_id":  "OyX9cC9WaV",
    "pdf_url":  "/pdf/21dcad91c68d16728c9f000317d63e17df0a19ec.pdf",
    "abstract":  "LiDAR-based world models offer more structured and geometry-aware representations than their image-based counterparts. However, existing LiDAR world models are narrowly trained; each model excels only in the domain for which it was built. This raises a critical question: can we develop LiDAR world models that exhibit strong transferability across multiple domains? To answer this, we conduct the first systematic domain transfer study across three demanding scenarios: (i) outdoor to indoor generalization, (ii) sparse- to dense-beam adaptation, and (iii) non-semantic to semantic transfer. Given different amounts of fine-tuning data, our experiments show that a single pretrained model can achieve up to 11\\% absolute improvement (83\\% relative) over training from scratch and outperforms training from scratch in 30/36 of our comparisons. This transferability significantly reduces the reliance on manually annotated data for semantic occupancy forecasting: our method exceeds previous baselines with only 5\\% of the labeled training data of prior work. We also observed inefficiencies of current generative-model-based LiDAR world models, mainly through their under-compression of LiDAR data and inefficient training objectives. To address these issues, we propose a latent conditional flow matching (CFM)-based framework that achieves state-of-the-art reconstruction accuracy using only half the training data and a compression ratio 6 times higher than that of prior methods. Our model also achieves SOTA performance on semantic occupancy forecasting while being 1.98x-23x more computationally efficient (a 1.1x-3.9x FPS speedup) than previous methods.",
    "keywords":  [
                     "LiDAR World Models",
                     "Generative models",
                     "Domain Adaption"
                 ],
    "local_pdf":  "Towards foundational LiDAR wor_NeurIPS2025.pdf"
}
